# Terminal stuff
cask "alacritty"
brew "fish"
cask "font-caskaydia-cove-nerd-font"
brew "helix"
brew "starship"
brew "zellij"

# Package managers
brew "node"
brew "mise"
brew "pipx"

# Git
brew "gh"
brew "git"
brew "gitui"

# LSP
brew "marksman"
brew "ruff"
brew "taplo"
brew "yaml-language-server"

# Linters
brew "actionlint"
brew "cfn-lint"
brew "sqlfluff"
brew "tflint"

# Terraform
tap "hashicorp/tap"
brew "opentofu"
brew "hashicorp/tap/terraform-ls"

# Window manager
cask "rectangle"

# Docker
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-completion"
brew "docker-compose"
brew "docker-credential-helper"
brew "dockerfile-language-server"

# Tools
brew "bacon"
brew "bat"
brew "dust"
brew "eza"
brew "fzf"
brew "jq"
brew "ripgrep"
brew "stow"
brew "usage"  # required by mise
brew "uv"

# Include local Brewfile if present
local_file = File.join(ENV["HOME"], "/.config/brew/local/Brewfile")
if File.file?(local_file) then
  instance_eval(File.read(local_file))
end
